---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.TextNode
source: html/7c29ed1e-e81b-354c-eb87-9047b83a704c.htm
---
# TextNode Members

Returns an FormattedText object that contains text and associated formatting of this TextNode.